---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.UnconnectedDevice
source: html/ffcdceb3-baf6-593f-75c7-eccc849d7f28.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.UnconnectedDevice Property

Device has an unconnected [Type Name] connector (index = [Index Number]).

## Syntax (C#)
```csharp
public static FailureDefinitionId UnconnectedDevice { get; }
```